# Рассмотрим треугольник из последовательных нечетных чисел:

#              1
#           3     5
#        7     9    11
#    13    15    17    19
# 21    23    25    27    29
# ...
# Вычислите сумму чисел в n-й строке этого треугольника (начиная с индекса 1), например: (Входные данные --> Выходные данные)

# 1 -->  1
# 2 --> 3 + 5 = 8

def row_sum_odd_numbers(row):
    return row ** 3

    # number =2
    # result = 1
    # row = row // 2
    # for number in range(row[1::2]):


    """Обращай внимание на построение задач, особенно полезно найти какую либо закономерность, в таком случае всегда может найтись формула для ее решения
    В данной задаче это возведение в  ** 3"""
    




        

        
        
    